[
    {
      "sectionNumber": "1.1",
      "Risk": "High",
      "controlNumber": "1.1.1",
      "controlTitle": "Ensure more than one Super Admin account exists.",
      "controlDescription": "Having more than one Super Admin account is needed primarily so that a single point of failure can be avoided. Also, for larger organizations, having multiple Super Admins can be useful for workload balancing purposes.",
      "rationaleStatement": "From a security point of view, having only a single Super Admin Account can be problematic if this user were unavailable for an extended period of time. Also, Super Admin accounts should never be shared amongst multiple users.",
      "impactStatement": "There should be no user impact, but Administrators should have a normal (low privilege) and an Administrative (high privilege) account.",
      "remediationProcedure": "Create at least one additional account with a Super Admin role.\n\nNOTE: A new account should be created vs adding this role to an existing account since Administration tasks should be done through separate Admin accounts.",
      "expected": "At least 1 Super Admin exists.",
      "color": "CF2512"
    },
    {
      "sectionNumber": "1.1",
      "Risk": "High",
      "controlNumber": "1.1.2",
      "controlTitle": " Ensure no more than 4 Super Admin accounts exist.",
      "controlDescription": "Having more than one Super Admin account is needed primarily so that a single point of failure can be avoided, but having too many should be avoided.",
      "rationaleStatement": "From a security point of view, having a large number of Super Admin accounts is a bad practice. In general, all users should be assigned the least privileges needed to do their job. This includes Administrators since not everyone that needs to \"Administer Something\" needs to be a Super Admin. Google Workspaces provides many predefined Administration Roles and also allows the creation of Custom Roles with very granular permission selection.",
      "impactStatement": "There should be no user impact, but Administrators should have a normal (low privilege) and an Administrative (high privilege) account.",
      "remediationProcedure": "Reduce the number of accounts with a \"Super Admin\" role.",
      "expected": "No more than 4 Super Admins exist.",
      "color": "CF2512"
    },
    {
      "sectionNumber": "1.2.1",
      "Risk": "Moderate",
      "controlNumber": "1.2.1.1",
      "controlTitle": " Ensure directory data access is externally restricted.",
      "controlDescription": "Configure Google Workspace's external directory sharing to prevent unrestricted directory data access.",
      "rationaleStatement": "If your organization uses third-party apps that integrate with your Google services, you control how much Directory information the external apps can access.\n\nIf you allow directory access, your users have a better experience with external apps. For example, when they use a third-party mail app, they want to find domain contacts and have email addresses automatically complete. The app needs access to Directory data to make this happen. However, this has the ability to share ALL domain AND public data with the connected third-party app.\n\n- Public data and authenticated user basic profile fields - Share publicly visible domain profile data with external apps and APIs. Also share the authenticated user's name, photo, and email address to enable Google Sign-In if the appropriate scopes are granted. Other non-public profile fields for the authenticated user aren't shared. All the non-public profile information of other users in the domain aren't shared.\n- Domain and public data - (Default) Share all Directory information that's shared with your domain and public data. This information includes profile information for users in your domain, shared external contacts, and Google+ profile names and photos.",
      "impactStatement": "The External directory sharing setting applies only to the following APIs and the Apps Scripts or third-party Marketplace apps that use those APIs:\n\n- Google People API\n- Google CardDAV API\n- Google Contacts API v3\n\nThe setting applies only to third-party apps, such as iOS Mail and iOS Contacts (when enrolled on an iOS device via Add Account and then Google), third-party Contacts apps (on Android).\n\nThe setting doesn't apply to Google products, including mobile apps, such as the following\n\n- Gmail, Contacts (on Android), Inbox, Meet, and other Google mobile apps\n- iOS Mail and iOS Contacts using Google Sync (when enrolled on an iOS device through Add Account and then Exchange)\n- Workspace Sync for Microsoft Outlook",
      "remediationProcedure": "To configure this setting via the Google Workspace Admin Console:\n\n1. Log in to https://admin.google.com as an administrator\n2. Open the collapsed menu via \"hamburger button (3 horizontal lines)\"\n3. Under Directory, select Directory settings\n4. Under Sharing settings, select External Directory sharing\n5. Select Public data and authenticated user basic profile fields",
      "expected": "External Directory sharing is set to: Public data and authenticated user basic profile fields.",
      "color": "FFC003"
    },
    {
      "sectionNumber": "3.1.1.1",
      "Risk": "Low",
      "controlNumber": "3.1.1.1.1",
      "controlTitle": "Ensure external sharing options for primary calendars are configured.",
      "controlDescription": "Control how much calendar information users in your organization can share externally.",
      "rationaleStatement": "Prevent data leakage by restricting the amount of information that is externally viewable when a user shares their calendar with someone external to your organization.",
      "impactStatement": "'- Once you limit external sharing for your organization, users can't exceed these limits when sharing individual events. For example, if you limit your organization's external sharing to Free/Busy, events with Public visibility are only shared as Free/Busy.\n- External mobile users who previously synced events may keep seeing restricted details. That access stops when their device is wiped and re-synced.\n- If you lower the external sharing level, people outside your organization may lose access to calendars they could previously see.",
      "remediationProcedure": "To configure this setting via the Google Workspace Admin Console:\n\n1. Log in to https://admin.google.com as an administrator\n2. Select Apps\n3. Select Google Workspace\n4. Select Calendar\n5. Under Sharing settings, select External sharing options for primary calendars\n6. Select Only free/busy information (hide event details)\n7. Select Save",
      "expected": "External sharing options for primary calendars is set to: Only free/busy information (hide event details)",
      "color": "FFFF00"
    },
    {
      "sectionNumber": "3.1.1.1",
      "Risk": "Low",
      "controlNumber": "3.1.1.1.3",
      "controlTitle": "Ensure external invitation warnings for Google Calendar are configured.",
      "controlDescription": "Configure Google Calendar to warn users when inviting guest outside your domain.",
      "rationaleStatement": "When your users create a Google Calendar event that includes one or more guests from outside of your domain, they are prompted to confirm whether it's OK to include external guests in the event invitation, assisting in the prevention of unintentional data leakage.",
      "impactStatement": "Users will be prompted to allow the inclusion of external guests in an event invitation.",
      "remediationProcedure": "To configure this setting via the Google Workspace Admin Console:\n\n1. Log in to https://admin.google.com as an administrator\n2. Select Apps\n3. Select Google Workspace\n4. Select Calendar\n5. Under Sharing settings, select External Invitations\n6. Set Warn users when inviting guests outside of the domain to checked\n7. Select Save",
      "expected": "Warn users when inviting guests outside of the domain is set to: ON",
      "color": "FFFF00"
    },
    {
      "sectionNumber": "3.1.1.2",
      "Risk": "Low",
      "controlNumber": "3.1.1.2.1",
      "controlTitle": "Ensure external sharing options for secondary calendars are configured.",
      "controlDescription": "Control how much calendar information users in your organization can share externally.",
      "rationaleStatement": "Prevent data leakage by restricting the amount of information is externally viewable when a user shares their calendar with someone external to your organization.",
      "impactStatement": "'- Once you limit external sharing for your organization, users can't exceed these limits when sharing individual events. For example, if you limit your organization's external sharing to Free/Busy, events with Public visibility are only shared as Free/Busy.\n- External mobile users who previously synced events may keep seeing restricted details. That access stops when their device is wiped and re-synced.\n- If you lower the external sharing level, people outside your organization may lose access to calendars they could previously see.",
      "remediationProcedure": "To configure this setting via the Google Workspace Admin Console:\n\n1. Log in to https://admin.google.com as an administrator\n2. Select Apps\n3. Select Google Workspace\n4. Select Calendar\n5. Under General settings, select External sharing options for secondary calendars\n6. Select Only free/busy information (hide event details)\n7. Select Save",
      "expected": "Only free/busy information (hide event details) is selected.",
      "color": "FFFF00"
    },
    {
      "sectionNumber": "3.1.2.1.1",
      "Risk": "High",
      "controlNumber": "3.1.2.1.1.1",
      "controlTitle": "Ensure users are warned when they share a file outside their domain.",
      "controlDescription": "Warn the user when they try and share a file and/or shared drive externally.",
      "rationaleStatement": "The user may not realize the potential account is external to the organization. Providing a warning allows the user an opportunity to know this and possibly reassess this sharing.",
      "impactStatement": "None, except an additional warning. Sharing can still occur.",
      "remediationProcedure": "To configure this setting via the Google Workspace Admin Console:\n\n1. Log in to https://admin.google.com as an administrator\n2. Select Apps\n3. Select Drive and Docs\n4. Select Sharing Settings\n5. Select Sharing Options\n6. Under Sharing outside of the organization\n7. Set ON - Files owned by users in the organization can be shared outside of the organization. This applies to files in all shared drives as well. to checked. Also, set the sub-setting For files owned by users in the organization warn when sharing outside of the organization to checked.\n8. Select Save",
      "expected": "Files can be shared outside of the domain: ON\nWarn when files are shared outside of the domain: True",
      "color": "CF2512"
    },
    {
      "sectionNumber": "3.1.2.1.1",
      "Risk": "High",
      "controlNumber": "3.1.2.1.1.2",
      "controlTitle": "Ensure users cannot publish files to the web or make visible to the world as public or unlisted.",
      "controlDescription": "You should control the publishing of documents to the web or making them visable to the world as public or unlisted.",
      "rationaleStatement": "Attackers will often attempt to expose sensitive information to external entities through sharing, and restricting the methods that your users can share documents with will reduce that surface area.\n\nThis setting is only applicable if ON - Files owned by users in the organization can be shared outside of the organization. This applies to files in all shared drives as well is selected, but should be configured as described below to prevent unintentional document publishing.",
      "impactStatement": "Enabling this feature will prevent users from publishing documents on the web or making them visible to the world as public or unlisted files.",
      "remediationProcedure": "To configure this setting via the Google Workspace Admin Console: \n\n1. Log in to https://admin.google.com as an administrator\n2. Select Apps\n3. Select Google Workspace\n4. Select Drive and Docs\n5. Under Sharing settings, select Sharing options\n6. Under Sharing outside of the organization - ON - Files owned by users in the organization can be shared outside of the organization. This applies to files in all shared drives as well, set When sharing outside of the organization is allowed, users in the organization can make files and published web content visible to anyone with the link to unchecked\n7. Select Save",
      "expected": "Users can make files and published web content visible to anyone with the link is set to: OFF",
      "color": "CF2512"
    },
    {
      "sectionNumber": "3.1.2.1.1",
      "Risk": "Moderate",
      "controlNumber": "3.1.2.1.1.5",
      "controlTitle": "Ensure Access Checker is configured to limit file access.",
      "controlDescription": "When a user shares a file via a Google product other than Docs or Drive (e.g. by pasting a link in Gmail), Google can check that the recipients have access. If not, when possible, Google will ask the user to pick how they want to share the file.",
      "rationaleStatement": "In general, access should be restricted to the smallest group possible. In this case recipients only.",
      "impactStatement": "Only recipients can access files. Recipients cannot share access with others by forwarding the email/link.",
      "remediationProcedure": "To configure this setting via the Google Workspace Admin Console:\n\n1. Log in to https://admin.google.com as an administrator\n2. Select Apps\n3. Select Drive and Docs\n4. Select Sharing Settings\n5. Select Sharing Options\n6. Under Access Checker\n7. Set Recipients only. to checked\n8. Select Save",
      "expected": "Access checker is set to: Recipients only",
      "color": "FFC003"
    },
    {
      "sectionNumber": "3.1.2.1.1",
      "Risk": "Moderate",
      "controlNumber": "3.1.2.1.1.6",
      "controlTitle": "Ensure only users inside your organization can distribute content externally.",
      "controlDescription": "You should control who is allowed to distribute organizational content to shared drives owned by another organization.",
      "rationaleStatement": "Sharing and collaboration are key; however, only your users should have the authority over where company content is shared with to prevent unauthorized disclosures of information.",
      "impactStatement": "Only people in your organization with Manager access to a shared drive can move files from that shared drive to a Drive location in a different organization.\n\nIn addition, users in the selected organizational unit or group can copy content from their My Drive to a shared drive owned by a different organization.",
      "remediationProcedure": "To configure this setting via the Google Workspace Admin Console:\n\n1. Log in to https://admin.google.com as an administrator\n2. Select Apps\n3. Select Google Workspace\n4. Select Drive and Docs\n5. Under Sharing settings, select Sharing options\n6. Under Distributing content outside of the organization, select - Only users in the organization\n7. Select Save",
      "expected": "Distributing content outside of the organization is set to: Only users in the domain",
      "color": "FFC003"
    },
    {
      "sectionNumber": "3.1.2.1.2",
      "Risk": "Low",
      "controlNumber": "3.1.2.1.2.1",
      "controlTitle": "Ensure users can create new shared drives.",
      "controlDescription": "All users should have the ability to create new shared drives.",
      "rationaleStatement": "By default, when a user account is deleted all the data in their personal drive is deleted as well. By allowing any user to create new shared drives aids in preventing data loss when user accounts are deleted.",
      "impactStatement": "Disabling this feature will prevent users from creating new shared drives.",
      "remediationProcedure": "To verify this setting via the Google Workspace Admin Console:\n\n1. Log in to https://admin.google.com as an administrator\n2. Select Apps\n3. Select Google Workspace\n4. Select Drive and Docs\n5. Under Sharing settings, select Shared drive creation\n6. Set Prevent users in the organization from creating new shared drives to unchecked\n7. Select Save",
      "expected": "Prevent users in the organization from creating new shared drives is set to: OFF",
      "color": "FFFF00"
    },
    {
      "sectionNumber": "3.1.2.1.2",
      "Risk": "Low",
      "controlNumber": "3.1.2.1.2.2",
      "controlTitle": "Ensure manager access members cannot modify shared drive settings.",
      "controlDescription": "Only administrators should be able to modify shared drive settings.",
      "rationaleStatement": "Allowing manager access members to override or modify shared drive settings can allow intentional and unintentional data access by unauthorized users.",
      "impactStatement": "Disabling this feature will prevent manager access members from modifying shared drive settings, requiring administrators to perform settings modifications as required.",
      "remediationProcedure": "To configure this setting via the Google Workspace Admin Console:\n\n1. Log in to https://admin.google.com as an administrator\n2. Select Apps\n3. Select Google Workspace\n4. Select Drive and Docs\n5. Select Sharing settings\n6. Under Shared drive creation, set Allow members with manager access to override the settings below to unchecked\n7. Select Save",
      "expected": "Allow members with manager access to override the settings below: OFF",
      "color": "FFFF00"
    },
    {
      "sectionNumber": "3.1.2.1.2",
      "Risk": "High",
      "controlNumber": "3.1.2.1.2.3",
      "controlTitle": "Ensure shared drive file access is restricted to members only.",
      "controlDescription": "Shared drive file access should be restricted to that shared drive's members.",
      "rationaleStatement": "Preventing unauthorized users from access sensitive data is paramount in preventing unauthorized or unintentional information disclosures.",
      "impactStatement": "Disabling this feature will prevent shared drive non-members from accessing content in shared drives where they are not a member.",
      "remediationProcedure": "To configure this setting via the Google Workspace Admin Console: \n\n1. Log in to https://admin.google.com as an administrator\n2. Select Apps\n3. Select Google Workspace\n4. Select Drive and Docs\n5. Select Sharing settings\n6. Under Shared drive creation, set Allow people who aren't shared drive members to be added to files to unchecked\n7. Select Save",
      "expected": "Allow people who aren't shared drive members to be added to files: OFF",
      "color": "CF2512"
    },
    {
      "sectionNumber": "3.1.2.2",
      "Risk": "Moderate",
      "controlNumber": "3.1.2.2.1",
      "controlTitle": "Ensure offline access to documents is disabled.",
      "controlDescription": "Prevent documents from being locally accessible on an unconnected device.",
      "rationaleStatement": "This setting prevents an organization's files from being stored locally, thus limiting data loss issues if the device is lost or stolen.",
      "impactStatement": "Copies of recent files are only synced and saved on devices if you've defined a managed policy to do so. \n\n**NOTE:** All users will lose access to offline documents on all devices if managed devices policies are not set.\n\n**NOTE:** Setting up policies to control offline access on individual devices is outside the scope of this Benchmark. Additional information om doing this for various device types can be found **[here](https://apps.google.com/supportwidget/articlehome?article_url=https%3A%2F%2Fsupport.google.com%2Fa%2Fanswer%2F1642623&product_context=1642623&product_name=UnuFlow&trigger_context=a)**.",
      "remediationProcedure": "To configure this setting via the Google Workspace Admin Console:\n\n1. Log in to https://admin.google.com as an administrator\n2. Select Apps\n3. Select Google Workspace\n4. Select Drive and Docs\n5. Select Features and Applications\n6. Select Offline\n7. Set Control offline access using device policies. to checked\n8. Select Save",
      "expected": "Offline access to documents is set to: Control offline access using device policies",
      "color": "FFC003"
    },
    {
      "sectionNumber": "3.1.2.2",
      "Risk": "Moderate",
      "controlNumber": "3.1.2.2.2",
      "controlTitle": "Ensure desktop access to Drive is disabled.",
      "controlDescription": "Prevent documents from being locally accessible on an unconnected device.",
      "rationaleStatement": "This setting prevents an organization's files from being stored locally, thus limiting data loss issues if the device is lost or stolen.\n\n**NOTE:** The Google Drive desktop application has its own way of handling \"Offline\" files and does not obey the Drive and Doc &gt; Offline &gt; Control offline access using divide policies setting. Not allowing Google Drive for desktop on the device will prevent this channel.",
      "impactStatement": "The end user will not be able to use Google Drive for desktop and its convenient integration into the Windows file explorer.",
      "remediationProcedure": "To verify this setting via the Google Workspace Admin Console:\n\n1. Log in to https://admin.google.com as an administrator\n2. Select Apps\n3. Select Google Workspace\n4. Select Drive and Docs\n5. Select Features and Applications\n6. Select Google Drive for desktop\n7. Set Allow Google Drive for desktop in your organization to unchecked\n8. Select Save",
      "expected": "Allow Google Drive for desktop in your organization: OFF",
      "color": "FFC003"
    },
    {
      "sectionNumber": "3.1.2.2",
      "Risk": "Moderate",
      "controlNumber": "3.1.2.2.3",
      "controlTitle": "Ensure Add-Ons is disabled.",
      "controlDescription": "Prevent users to install Google Docs add-ons from add-ons store.\n\n**NOTE:** This setting controls add-on access from outside your organization.",
      "rationaleStatement": "Allowing uses to install unapproved Add-Ons puts the organization at risk. If users need a specific Add-On this can be handled on a case by case basis as the need, and the add-on, is approved.",
      "impactStatement": "The end user will not be able to use Google Drive for desktop and its convenient integration into the Windows file explorer.",
      "remediationProcedure": "To verify this setting via the Google Workspace Admin Console:\n\n1. Log in to https://admin.google.com as an administrator\n2. Select Apps\n3. Select Google Workspace\n4. Select Drive and Docs\n5. Select Features and Applications\n6. Select Add-Ons\n7. Set Allow users to install Google Docs add-ons from add-ons store. to unchecked\n8. Select Save",
      "expected": "Allow users to install Google Docs add-ons from add-ons store: OFF",
      "color": "FFC003"
    },
    {
      "sectionNumber": "3.1.3.1",
      "Risk": "High",
      "controlNumber": "3.1.3.1.1",
      "controlTitle": "Ensure users cannot delegate access to their mailbox.",
      "controlDescription": "Mail delegation allows the delegate to read, send, and delete messages on their behalf. For example, a manager can delegate Gmail access to another person in their organization, such as an administrative assistant.",
      "rationaleStatement": "Only administrators should be able to delegate access to a user's mailboxes.",
      "impactStatement": "Existing delegations will be hidden, when this feature is disabled.",
      "remediationProcedure": "To configure this setting via the Google Workspace Admin Console:\n\n1. Log in to https://admin.google.com as an administrator\n2. Select Apps\n3. Select Google Workspace\n4. Select Gmail\n5. Under User Settings - Mail delegation, set Let users delegate access to their mailbox to other users in the domain to unchecked\n6. Select Save",
      "expected": "Let users delegate access to their mailbox to other users in the domain: OFF",
      "color": "CF2512"
    },
    {
      "sectionNumber": "3.1.3.1",
      "Risk": "High",
      "controlNumber": "3.1.3.1.2",
      "controlTitle": "Ensure offline access to Gmail is disabled.",
      "controlDescription": "Disables the user's ability to utilize various Gmail functions (read, write, search, delete, and label email messages) while not connected to the internet.",
      "rationaleStatement": "Prevents the organization's data (user's email) from being copied to remote computers.",
      "impactStatement": "Users will need internet access to use Gmail.",
      "remediationProcedure": "To configure this setting via the Google Workspace Admin Console: \n\n1. Log in to https://admin.google.com as an administrator\n2. Select Apps\n3. Select Gmail\n4. Select User Settings\n5. SelectGmail web offline\n7. Set Enable Gmail web offline to unchecked\n8. Select Save",
      "expected": "Enable Gmail web offline: OFF",
      "color": "CF2512"
    },
    {
      "sectionNumber": "3.1.3.2",
      "Risk": "Moderate",
      "controlNumber": "3.1.3.2.1",
      "controlTitle": "Ensure that DKIM is enabled for all mail enabled domains.",
      "controlDescription": "DKIM adds an encrypted signature to the header of all outgoing messages. Email servers that get signed messages use DKIM to decrypt the message header, and verify the message was not changed after it was sent.",
      "rationaleStatement": "Spoofing is a common unauthorized use of email, so some email servers require DKIM to prevent email spoofing.",
      "impactStatement": "There should be no impact of setting up DKIM however, organizations should ensure appropriate setup to ensure continuous mail-flow.",
      "remediationProcedure": "To configure this setting via the Google Workspace Admin Console: \n\n1. Log in to https://admin.google.com as an administrator\n2. Select Apps\n3. Select Google Workspace\n4. Select Gmail\n5. Under Authenticate email, select - Generate new record\n6. Under Select DKIM key bit length, select the appropriate key bit length _2048 is recommended if supported_\n7. Under Prefix selector (optional), enter the appropriate prefix selector\n8. Use the text at TXT record value to update the DNS record at your domain host\n9. Select Start Authentication",
      "expected": "Ensure a DKIM record exists for each mail-enabled domain",
      "color": "FFC003"
    },
    {
      "sectionNumber": "3.1.3.2",
      "Risk": "Moderate",
      "controlNumber": "3.1.3.2.2",
      "controlTitle": "Ensure the SPF record is configured for all mail enabled domains.",
      "controlDescription": "For all the email domains configured in Google Workspace, a corresponding Sender Policy Framework (SPF) record should be created.",
      "rationaleStatement": "SPF records allow Gmail and other mail systems to know where messages from your domains are allowed to originate. This information can be used by that system to determine how to treat the message based on if it is being spoofed or is valid.",
      "impactStatement": "There should be minimal impact of setting up SPF records however, organizations should ensure proper SPF record setup as email could be flagged as spam if SPF is not set up appropriately.",
      "remediationProcedure": "Configure the DNS record for each domain.\n\n- If all email in your domain is sent from and received by Google Gmail, add the following TXT record for each domain:\n\n\nv=spf1 include:_spf.google.com ~all.",
      "expected": "Ensure that an appropriate SPF record is found",
      "color": "FFC003"
    },
    {
      "sectionNumber": "3.1.3.2",
      "Risk": "Moderate",
      "controlNumber": "3.1.3.2.3",
      "controlTitle": "Ensure the DMARC record is configured for all mail enabled domains.",
      "controlDescription": "For all email domains configured in Google Workspace, a corresponding Domain-Based Message Authentication, Reporting and Conformance (DMARC) record should be created.",
      "rationaleStatement": "DMARC works with Sender Policy Framework (SPF) and Domain Keys Identified Mail (DKIM) to authenticate mail senders and ensure that destination email systems trust messages sent from your domain. Spammers can spoof your domain or organization to send fake messages that impersonate your organization. DMARC tells receiving mail servers what to do when they get a message that appears to be from your organization, but doesn't pass authentication checks, or doesn't meet the authentication requirements in your DMARC policy record. Messages that aren't authenticated might be impersonating your organization, or might be sent from unauthorized servers.",
      "impactStatement": "There should be minimal impact of setting up DMARC records however, organizations should ensure proper DMARC record setup as email could be flagged as spam if DMARC is not set up appropriately.",
      "remediationProcedure": "Configure the DNS record for each domain.\n\n1. If all email in your domain is sent from and received by Google Gmail, add the following TXT record for the domain:\n\n\nv=DMARC1; p=none; rua=mailto:&lt;report@domain1.com&gt;",
      "expected": "Ensure that a TXT Record with the value of v=DMARC1; p=none; rua=mailto:&lt;report@domain1.com&gt; exists",
      "color": "FFC003"
    },
    {
      "sectionNumber": "3.1.3.3",
      "Risk": "High",
      "controlNumber": "3.1.3.3.1",
      "controlTitle": "Enable quarantine admin notifications for Gmail.",
      "controlDescription": "Quarantines can help prevent spam, minimize data loss, and protect confidential information. They can also help moderate message attachments so users don't send, open, or click something they shouldn't.",
      "rationaleStatement": "Admins should be notified periodically when messages are quarantined so they can take the appropriate actions.",
      "impactStatement": "Admins will begin receiving quarantine notifications as emails are quarantined.",
      "remediationProcedure": "To configure this setting via the Google Workspace Admin Console: \n\n1. Log in to https://admin.google.com as an administrator\n2. Select Apps\n3. Select Google Workspace\n4. Select Gmail\n5. Under Manage quarantines, set Notify periodically when messages are quarantined to checked\n\n_As required, give appropriate users the Access Admin Quarantine and\\or Access restricted quarantine roles_",
      "expected": "Notify periodically when messages are quarantined: ON",
      "color": "CF2512"
    },
    {
      "sectionNumber": "3.1.3.4.1",
      "Risk": "High",
      "controlNumber": "3.1.3.4.1.1",
      "controlTitle": "Ensure protection against encrypted attachments from untrusted senders is enabled.",
      "controlDescription": "As a Google Workspace administrator, you can protect incoming mail against phishing and harmful software (malware). You can also choose what action to take based on the type of threat detected.",
      "rationaleStatement": "You should protect your users from potentially malicious attachments.",
      "impactStatement": "Users will be warned when they receive an encrypted attachment from an untrusted sender.",
      "remediationProcedure": "To configure this setting via the Google Workspace Admin Console:\n\n1. Log in to https://admin.google.com as an administrator\n2. Select Apps\n3. Select Google Workspace\n4. Select Gmail\n5. Under Safety - Attachments, set Protect against encrypted attachments from untrusted senders to checked\n6. Select Save",
      "expected": "Protect against encrypted attachments from untrusted senders: ON",
      "color": "CF2512"
    },
    {
      "sectionNumber": "3.1.3.4.1",
      "Risk": "Moderate",
      "controlNumber": "3.1.3.4.1.2",
      "controlTitle": "Ensure protection against attachments with scripts from untrusted senders is enabled.",
      "controlDescription": "As a Google Workspace administrator, you can protect incoming mail against phishing and harmful software (malware). You can also choose what action to take based on the type of threat detected.",
      "rationaleStatement": "You should protect your users from potentially malicious attachments.",
      "impactStatement": "Users will be warned when they receive an attachments with scripts from an untrusted sender.",
      "remediationProcedure": "To verify this setting via the Google Workspace Admin Console:\n\n1. Log in to https://admin.google.com as an administrator\n2. Select Apps\n3. Select Google Workspace\n4. Select Gmail\n5. Under Safety - Attachments, set Protect against attachments with scripts from untrusted senders to checked\n6. Select Save",
      "expected": "Protect against attachments with scripts from untrusted senders: ON",
      "color": "FFC003"
    },
    {
      "sectionNumber": "3.1.3.4.1",
      "Risk": "Moderate",
      "controlNumber": "3.1.3.4.1.3",
      "controlTitle": "Ensure protection against anomalous attachment types in emails is enabled.",
      "controlDescription": "As a Google Workspace administrator, you can protect incoming mail against phishing and harmful software (malware). You can also choose what action to take based on the type of threat detected.",
      "rationaleStatement": "You should protect your users from potentially malicious attachments.",
      "impactStatement": "Users will be warned when they receive an anomalous attachment.",
      "remediationProcedure": "To configure this setting via the Google Workspace Admin Console:\n\n1. Log in to https://admin.google.com as an administrator\n2. Select Apps\n3. Select Google Workspace\n4. Select Gmail\n5. Under Safety - Attachments, set Protect against anomalous attachment types in emails to checked\n6. Select Save",
      "expected": "Protect against anomalous attachment types in emails: ON",
      "color": "FFC003"
    },
    {
      "sectionNumber": "3.1.3.4.2",
      "Risk": "High",
      "controlNumber": "3.1.3.4.2.1",
      "controlTitle": "Ensure link identification behind shortened URLs is enabled.",
      "controlDescription": "Identify links behind short URLs, and display a warning when you click links to untrusted domains.",
      "rationaleStatement": "You should protect your users from potentially malicious links.",
      "impactStatement": "Users will be warned when they click links to untrusted domains.",
      "remediationProcedure": "To verify this setting via the Google Workspace Admin Console:\n\n1. Log in to https://admin.google.com as an administrator\n2. Select Apps\n3. Select Google Workspace\n4. Select Gmail\n5. Under Safety - Links and external images, set Identify links behind shortened URLs to checked\n6. Select Save",
      "expected": "Identify links behind shortened URLs: ON",
      "color": "CF2512"
    },
    {
      "sectionNumber": "3.1.3.4.2",
      "Risk": "Low",
      "controlNumber": "3.1.3.4.2.2",
      "controlTitle": "Ensure scan linked images for malicious content is enabled.",
      "controlDescription": "Scan linked images for malicious content, and display a warning when you click links to untrusted domains.",
      "rationaleStatement": "You should protect your users from potentially malicious links.",
      "impactStatement": "Users will be warned when they click links to untrusted domains.",
      "remediationProcedure": "To configure this setting via the Google Workspace Admin Console:\n\n1. Log in to https://admin.google.com as an administrator\n2. Select Apps\n3. Select Google Workspace\n4. Select Gmail\n5. Under Safety - Links and external images, set Scan linked images to checked\n6. Select Save",
      "expected": "Scan linked images: ON",
      "color": "FFFF00"
    },
    {
      "sectionNumber": "3.1.3.4.2",
      "Risk": "High",
      "controlNumber": "3.1.3.4.2.3",
      "controlTitle": "Ensure warning prompt is shown for any click on links to untrusted domains.",
      "controlDescription": "Display a warning when you click links to untrusted domains.",
      "rationaleStatement": "You should protect your users from potentially malicious links.",
      "impactStatement": "Users will be warned when they click links to untrusted domains.",
      "remediationProcedure": "To configure this setting via the Google Workspace Admin Console:\n\n1. Log in to https://admin.google.com as an administrator\n2. Select Apps\n3. Select Google Workspace\n4. Select Gmail\n5. Under Safety - Links and external images, set Show warning prompt for any click on links to untrusted domains is checked\n6. Select Save",
      "expected": "Show warning prompt for any click on links to untrusted domains: ON",
      "color": "CF2512"
    },
    {
      "sectionNumber": "3.1.3.4.3",
      "Risk": "High",
      "controlNumber": "3.1.3.4.3.1",
      "controlTitle": "Ensure protection against domain spoofing based on similar domain names is enabled.",
      "controlDescription": "Moves domain spoofing emails to spam folder.",
      "rationaleStatement": "You should protect your users from domain spoofing emails.",
      "impactStatement": "Domain spoofed emails will be moved to a user's spam folder.",
      "remediationProcedure": "To verify this setting via the Google Workspace Admin Console: \n\n1. Log in to https://admin.google.com as an administrator\n2. Select Apps\n3. Select Google Workspace\n4. Select Gmail\n5. Under Safety - Spoofing and authentication, set Protect against domain spoofing based on similar domain names to checked\n6. Set Action to Move email to spam\n7. Select Save",
      "expected": "Protect against domain spoofing based on similar domain names: ON and Action is set to: Move email to spam",
      "color": "CF2512"
    },
    {
      "sectionNumber": "3.1.3.4.3",
      "Risk": "Moderate",
      "controlNumber": "3.1.3.4.3.2",
      "controlTitle": "Ensure protection against spoofing of employee names is enabled.",
      "controlDescription": "Moves employee spoofing emails to spam folder.",
      "rationaleStatement": "You should protect your users from employee spoofing emails.",
      "impactStatement": "Employee spoofed emails will be moved to a user's spam folder.",
      "remediationProcedure": "To verify this setting via the Google Workspace Admin Console:\n\n1. Log in to https://admin.google.com as an administrator\n2. Select Apps\n3. Select Google Workspace\n4. Select Gmail\n5. Under Safety - Spoofing and authentication, set Protect against spoofing of employee names to checked\n6. Set Action to Move email to spam\n7. Select Save",
      "expected": "Protect against spoofing of employee names: ON and Action is set to: Move email to spam",
      "color": "FFC003"
    },
    {
      "sectionNumber": "3.1.3.4.3",
      "Risk": "High",
      "controlNumber": "3.1.3.4.3.3",
      "controlTitle": "Ensure protection against inbound emails spoofing your domain is enabled.",
      "controlDescription": "Moves inbound emails spoofing your domain to spam folder.",
      "rationaleStatement": "You should protect your users from inbound company domain spoofing emails.",
      "impactStatement": "Inbound company domain spoofed emails will be moved to a user's spam folder.",
      "remediationProcedure": "To configure this setting via the Google Workspace Admin Console:\n\n1. Log in to https://admin.google.com as an administrator\n2. Select Apps\n3. Select Google Workspace\n4. Select Gmail\n5. Under Safety - Spoofing and authentication, set Protect against inbound emails spoofing your domain to checked\n6. Set Action to Move email to spam\n7. Select Save",
      "expected": "Protect against inbound emails spoofing your domain: ON and Action is set to: Move email to spam",
      "color": "CF2512"
    },
    {
      "sectionNumber": "3.1.3.4.3",
      "Risk": "Moderate",
      "controlNumber": "3.1.3.4.3.4",
      "controlTitle": "Ensure protection against any unauthenticated emails is enabled.",
      "controlDescription": "Displays a warning when any message is not authenticated (SPF or DKIM).",
      "rationaleStatement": "You should protect your users from any emails that aren't authenticated (SPF or DKIM)",
      "impactStatement": "Emails that aren't authenticated (SPF or DKIM) display a warning message to the recipient.",
      "remediationProcedure": "To verify this setting via the Google Workspace Admin Console:\n\n1. Log in to https://admin.google.com as an administrator\n2. Select Apps\n3. Select Google Workspace\n4. Select Gmail\n5. Under Safety - Spoofing and authentication, set Protect against any unauthenticated emails to checked\n6. Select Save",
      "expected": "Protect against any unauthenticated emails: ON",
      "color": "FFC003"
    },
    {
      "sectionNumber": "3.1.3.4.3",
      "Risk": "Moderate",
      "controlNumber": "3.1.3.4.3.5",
      "controlTitle": "Ensure Groups are protected from inbound emails spoofing your domain.",
      "controlDescription": "If a group receives an email that is spoofing your domain it is sent to the spam folder.",
      "rationaleStatement": "You should protect your groups from any emails that spoofing your domain.",
      "impactStatement": "Emails that are spoofing your domain and are received by a group are sent to the spam folder.",
      "remediationProcedure": "To configure this setting via the Google Workspace Admin Console:\n\n1. Log in to https://admin.google.com as an administrator\n2. Select Apps\n3. Select Google Workspace\n4. Select Gmail\n5. Under Safety - Spoofing and authentication, set Protect your Groups from inbound emails spoofing your domain to checked\n6. Set Action to Move email to spam\n7. Select Save",
      "expected": "Protect your Groups from inbound emails spoofing your domain: ON and Action is set to: Move email to spam",
      "color": "FFC003"
    },
    {
      "sectionNumber": "3.1.3.5",
      "Risk": "Moderate",
      "controlNumber": "3.1.3.5.2",
      "controlTitle": "Ensure automatic forwarding options are disabled.",
      "controlDescription": "You should disable automatic forwarding to prevent users from auto-forwarding mail.",
      "rationaleStatement": "In the event that an attacker gains control of an end-user account they could create rules to ex-filtrate data from your environment.",
      "impactStatement": "Care should be taken before implementation to ensure there is no business need for case-by-case auto-forwarding. Disabling auto-forwarding to remote domains will affect all users and in an organization.",
      "remediationProcedure": "To verify this setting via the Google Workspace Admin Console: \n\n1. Log in to https://admin.google.com as an administrator\n2. Select Apps\n3. Select Google Workspace\n4. Select Gmail\n5. Under End User Access - Automatic forwarding, set Allow users to automatically forward incoming email to another address to unchecked\n6. Select Save",
      "expected": "Allow users to automatically forward incoming email to another address: OFF",
      "color": "FFC003"
    },
    {
      "sectionNumber": "3.1.3.5",
      "Risk": "Low",
      "controlNumber": "3.1.3.5.3",
      "controlTitle": "Ensure per-user outbound gateways is disabled.",
      "controlDescription": "A per-user outbound gateway is a mail server, other than the Google Workspace mail servers, that delivers outgoing mail for a user in your domain.",
      "rationaleStatement": "Mail sent via external SMTP will circumvent your outbound gateway",
      "impactStatement": "Care should be taken before implementation to ensure there is no business need for mail sent via external SMTP gateway.",
      "remediationProcedure": "To configure this setting via the Google Workspace Admin Console: \n\n1. Log in to https://admin.google.com as an administrator\n2. Select Apps\n3. Select Google Workspace\n4. Select Gmail\n5. Under End User Access - Allow per-user outbound gateways, set Allow users to send mail through an external SMTP server when configuring a \"from\" address hosted outside your email domain to unchecked\n6. Select Save",
      "expected": "Allow users to send mail through an external SMTP server when configuring a 'from' address hosted outside your email domain: OFF",
      "color": "FFFF00"
    },
    {
      "sectionNumber": "3.1.3.5",
      "Risk": "High",
      "controlNumber": "3.1.3.5.4",
      "controlTitle": "Ensure external recipient warnings are enabled.",
      "controlDescription": "Gmail adds an image or colored border to external addresses.",
      "rationaleStatement": "As an admin for your organization, you can turn alerts on or off for messages that include external recipients (people with email addresses outside of your organization). These alerts help people avoid unintentional replies, and remind them to treat external messages with caution.",
      "impactStatement": "When this setting is on, Gmail shows warnings (colored boarder) when:\n\n- An email thread includes external recipients (not available on iOS).\n- Replying to a message from an external recipient.\n- Composing a new message to an external recipient (not available on iOS).\n\nGmail doesn't show a warning if the external recipient is in your organization's Directory, personal Contacts, or other Contacts. Warnings aren't displayed for secondary domain or domain alias addresses.",
      "remediationProcedure": "**To configure external recipient warnings are enabled, use the Google Workspace Admin Console:** \n\n1. Log in to https://admin.google.com as an administrator\n2. Select Apps\n3. Select Google Workspace\n4. Select Gmail\n5. Select End User Access\n6. Select Warn for external recipients\n7. Set Highlight any external recipients in a conversation. Warn users before they reply to email with external recipients who aren't in their contacts. to checked\n8. Select Save",
      "expected": "Highlight any external recipients in a conversation. Warn users before they reply to email with external recipients who aren't in their contacts.: ON",
      "color": "CF2512"
    },
    {
      "sectionNumber": "3.1.3.6",
      "Risk": "Low",
      "controlNumber": "3.1.3.6.1",
      "controlTitle": "Ensure enhanced pre-delivery message scanning is enabled.",
      "controlDescription": "Enables improved detection of suspicious content prior to delivery.",
      "rationaleStatement": "As an administrator, you can increase Gmail's ability to identify suspicious content with enhanced pre-delivery message scanning. Typically, when Gmail identifies a possible phishing message, a warning is displayed and the message might be moved to spam.",
      "impactStatement": "With the Enhanced pre-delivery message scanning option, when Gmail detects suspicious content, message delivery is slightly delayed so that Gmail can do additional security checks on the message.",
      "remediationProcedure": "To configure this setting via the Google Workspace Admin Console:\n\n1. Log in to https://admin.google.com as an administrator\n2. Select Apps\n3. Select Google Workspace\n4. Select Gmail\n5. Select Spam, phishing, and malware\n6. Select Enhanced pre-delivery message scanning.\n7. Set Enables improved detection of suspicious content prior to delivery to checked\n8. Select Save",
      "expected": "Enables improved detection of suspicious content prior to delivery: ON",
      "color": "FFFF00"
    },
    {
      "sectionNumber": "3.1.3.6",
      "Risk": "Moderate",
      "controlNumber": "3.1.3.6.2",
      "controlTitle": "Ensure spam filters are not bypased for internal senders.",
      "controlDescription": "You can configure your advanced Gmail settings to bypass, or not bypass, spam filters for messages received from internal senders.",
      "rationaleStatement": "Turning off this setting reduces the risk of spoofing and phishing/whaling.",
      "impactStatement": "Your users will be better protected by filtering their email for spam and minimizing the chances for spoofing and phishing/whaling attacks.",
      "remediationProcedure": "To configure this setting via the Google Workspace Admin Console:\n\n1. Log in to https://admin.google.com as an administrator\n2. Select Apps\n3. Select Google Workspace\n4. Select Gmail\n5. Select Spam, phishing, and malware\n6. Under Spam, select Configure\n7. Set Bypass spam filters for messages received from internal senders. to unchecked\n8. Select Save",
      "expected": "Bypass spam filters for messages received from internal senders is: OFF",
      "color": "FFC003"
    },
    {
      "sectionNumber": "3.1.3.7",
      "Risk": "Low",
      "controlNumber": "3.1.3.7.1",
      "controlTitle": "Ensure comprehensive mail storage is enabled.",
      "controlDescription": "Comprehensive mail storage ensures messages sent by other core services appear in users' sent folders and are therefore accessible to Vault.",
      "rationaleStatement": "As an administrator, you can ensure that a copy of all sent or received messages in your domain-including messages sent or received by non-Gmail mailboxes-is stored in the associated users' Gmail mailboxes.",
      "impactStatement": "There are some important considerations to carefully review before enabling comprehensive mail storage:\n\n- You should not enable comprehensive mail storage if you have compliance routing rules that change the recipient (and don't want the original recipient to receive a copy of the email).\n- When you have the SMTP Relay service enabled, user mailboxes will keep a copy of the message in the sent folder (for example, when sending mail from a scanner) if comprehensive mail storage is enabled. This might cause accounts to exceed storage limits if your account's edition has storage limits. Compare editions. \n- You should enable comprehensive mail storage if you only use Gmail for the Vault feature and forward email to your on-premise mail server or other email provider.",
      "remediationProcedure": "To configure this setting via the Google Workspace Admin Console:\n\n1. Log in to https://admin.google.com as an administrator\n2. Select Apps\n3. Select Google Workspace\n4. Select Gmail\n5. Select Compliance\n6. Select Comprehensive mail storage\n7. Set Ensure that a copy of all sent and received mail is stored in associated users' mailboxes to checked \n8. Select Save",
      "expected": "Ensure that a copy of all sent and received mail is stored in associated users' mailboxes: ON",
      "color": "FFFF00"
    },
    {
      "sectionNumber": "3.1.4.1",
      "Risk": "Moderate",
      "controlNumber": "3.1.4.1.1",
      "controlTitle": "Ensure external filesharing in Google Chat and Hangouts is disabled.",
      "controlDescription": "Control how files are shared externally in Google Chat and Hangouts.",
      "rationaleStatement": "Files often contain confidential information, and some organizations, particularly in regulated industries, need to control the flow of this information within and outside of their organization.",
      "impactStatement": "Users will not be able to share files via chat externally.",
      "remediationProcedure": "To configure this setting via the Google Workspace Admin Console: \n\n1. Log in to https://admin.google.com as an administrator\n2. Select Apps\n3. Select Google Chat and classic Hangouts\n4. Select Chat File Sharing\n5. Under Setting, set External filesharing to No files\n6. Select Save",
      "expected": "External filesharing is set to: No Files",
      "color": "FFC003"
    },
    {
      "sectionNumber": "3.1.4.2",
      "Risk": "Moderate",
      "controlNumber": "3.1.4.2.2",
      "controlTitle": "Ensure Google Chat externally is restricted to allowed domains.",
      "controlDescription": "Control how users chat with people outside of your organization. If you allow your users to chat externally, you can also allow them to create and join spaces with people outside your organization.",
      "rationaleStatement": "Restricting external chat to only approved domains potentially limits the spread of company information.",
      "impactStatement": "Users will not be able to chat with users in any external domain, only approved domains. This will require some admin-level approval and allowlist maintenance.",
      "remediationProcedure": "To configure this setting via the Google Workspace Admin Console:\n\n1. Log in to https://admin.google.com as an administrator\n2. Select Apps\n3. Select Google Chat and classic Hangouts\n4. Select External Chat Settings\n5. Select Chat externally\n6. Set Allow users to send messages outside the organization to ON\n7. Set Only allow this for allowlisted domains to checked\n8. Select Save",
      "expected": "Allow users to chat externally is set to: ON\nRestrict external chats to allowlisted domains: True",
      "color": "FFC003"
    },
    {
      "sectionNumber": "3.1.4.3",
      "Risk": "Low",
      "controlNumber": "3.1.4.3.1",
      "controlTitle": "Ensure external spaces in Google Chat and Hangouts are restricted.",
      "controlDescription": "Control whether users can create or join spaces within your organization that include external people outside of your organization.",
      "rationaleStatement": "Restricting external spaces to only approved domains potentially limits the spread of company information.",
      "impactStatement": "Users with this setting turned off or who have editions that don't support external spaces can't create these spaces, but they can join existing spaces with external people",
      "remediationProcedure": "To verify this setting via the Google Workspace Admin Console: \n\n1. Log in to https://admin.google.com as an administrator\n2. Select Apps\n3. Select Google Chat and classic Hangouts\n4. Select External Spaces\n5. Under Setting, set Allow users at &lt;domain&gt; to create and join spaces with people outside their organization to ON\n6. Set Only allow users to add people from allowlisted domains to checked\n7. Select Save",
      "expected": "Users can create and join spaces with people outside their organization: ON\nOnly allow users to add people from allowlisted domains: True",
      "color": "FFFF00"
    },
    {
      "sectionNumber": "3.1.4.4",
      "Risk": "Low",
      "controlNumber": "3.1.4.4.1",
      "controlTitle": "Ensure allow users to install Chat apps is disabled.",
      "controlDescription": "Control the use of Chat apps in spaces or direct messages to connect to services in Google Chat and look up information, schedule meetings, or complete tasks. Apps are accounts created by Google, users in your organization, or third parties.",
      "rationaleStatement": "When a user interacts with an app in Chat, the app can see the user's email address, avatar, other basic user information, user locale, timezone, and interaction information. The app can also see the basic user information of other people in the chat, but it can't see their email address or avatar unless they also interact directly with the app. \n\nChat apps that you install from the Google Workspace Marketplace can be made by developers from outside of your organization.\n\nUsing these Chat app need to be carefully controlled (vetted and approved) since a malicious Chat app could allow the exfiltration of company proprietary information.",
      "impactStatement": "By default users will not be able to install Chat apps.",
      "remediationProcedure": "To configure this setting via the Google Workspace Admin Console:\n\n1. Log in to https://admin.google.com as an administrator\n2. Select Apps\n3. Select Google Chat and classic Hangouts\n4. Select Chat apps\n5. Under Chat apps access settings, set Allow users to install Chat apps to OFF\n6. Select Save",
      "expected": "Allow users to install Chat apps: OFF",
      "color": "FFFF00"
    },
    {
      "sectionNumber": "3.1.4.4",
      "Risk": "Moderate",
      "controlNumber": "3.1.4.4.2",
      "controlTitle": "Ensure allow users to add and use incoming webhooks is disabled.",
      "controlDescription": "Allow users to configure incoming webhooks and developers to call incoming webhooks to post content. Incoming webhooks let you send asynchronous messages into Google Chat from applications that aren't Chat apps.",
      "rationaleStatement": "Webhook usage should be carefully controlled (vetted and approved) since a malicious application could send bogus information to exposed webhooks and ultimately these users.",
      "impactStatement": "By default users will have exposed webhooks.",
      "remediationProcedure": "To configure this setting via the Google Workspace Admin Console:\n\n1. Log in to https://admin.google.com as an administrator\n2. Select Apps\n3. Select Google Chat and classic Hangouts\n4. Select Chat apps\n5. Under Chat apps access settings, set Allow users to add and use incoming webhooks to OFF",
      "expected": "Allow users to add and use incoming webhooks: OFF",
      "color": "FFC003"
    },
    {
      "sectionNumber": "3.1.6",
      "Risk": "Low",
      "controlNumber": "3.1.6.1",
      "controlTitle": "Ensure accessing groups from outside this organization is set to private.",
      "controlDescription": "Choose whether people outside your organization can access your groups. Group owners can further restrict access as needed.",
      "rationaleStatement": "Who can externally view groups internal to the organization should be carefully controlled and their access vetted as needed.",
      "impactStatement": "No one outside your organization can view or search for your groups. External users can email the group if group settings allow.",
      "remediationProcedure": "To configure this setting via the Google Workspace Admin Console:\n\n1. Log in to https://admin.google.com as an administrator\n2. Select Apps\n3. Select Google Workspace\n3. Select Groups for Business\n4. Select Sharing options\n5. Set Accessing groups from outside this organization to Private\n6. Select Save",
      "expected": "Accessing groups from outside this organization is set to: Private",
      "color": "FFFF00"
    },
    {
      "sectionNumber": "3.1.6",
      "Risk": "High",
      "controlNumber": "3.1.6.2",
      "controlTitle": "Ensure creating groups is restricted.",
      "controlDescription": "Control who is allowed to create Groups in your organization and if they can have external members.",
      "rationaleStatement": "The organization should have some control over the organizational groups created and the purpose they are for.",
      "impactStatement": "In a large organization, this may cause too much burden on administrators.",
      "remediationProcedure": "To configure this setting via the Google Workspace Admin Console:\n\n1. Log in to https://admin.google.com as an administrator\n2. Select Apps\n3. Select Google Workspace\n4. Select Groups for Business\n5. Select Creating groups\n6. Select Only organization admins can create groups\n7. Set Group owners can allow external members Organization admins can always add external members to unchecked\n8. Set Group owners can allow incoming email from outside the organization to unchecked\n6. Select Save",
      "expected": "Creating Groups is set to: Only organization admins can create groups\nGroup owners can allow external members: False\nGroup owners can allow incoming email from outside the organization: False",
      "color": "CF2512"
    },
    {
      "sectionNumber": "3.1.6",
      "Risk": "High",
      "controlNumber": "3.1.6.3",
      "controlTitle": "Ensure default for permission to view conversations is restricted.",
      "controlDescription": "By default, only allow group members to view group conversations.",
      "rationaleStatement": "Conversation viewing can always be expanded by exception for certain groups as needed (Need to know), but by default be restricted.",
      "impactStatement": "No practical impact, since Group members can view conversations in the Group.",
      "remediationProcedure": "To configure this setting via the Google Workspace Admin Console: \n\n1. Log in to https://admin.google.com as an administrator\n2. Select Apps\n3. Select Google Workspace\n3. Select Groups for Business\n4. Select Sharing options\n5. Set Default for permission to view conversations to All group members\n6. Select Save",
      "expected": "Default for permission to view conversations is set to: All group members",
      "color": "CF2512"
    },
    {
      "sectionNumber": "3.1.7",
      "Risk": "Moderate",
      "controlNumber": "3.1.7.1",
      "controlTitle": "Ensure service status for Google Sites is set to off.",
      "controlDescription": "By default turn off Google Sites for all users.",
      "rationaleStatement": "There is really no reason for every user within an organization to have access to Google Sites. If this capability is needed, it can be enabled and configured for those users and groups by exception as required by the organization to meet specific needs.",
      "impactStatement": "Users will not be have access to Google Sites.",
      "remediationProcedure": "To configure this setting via the Google Workspace Admin Console: \n\n1. Log in to https://admin.google.com as an administrator\n2. Select Apps\n3. Select Google Workspace\n4. Select Sites\n5. Select Service status\n6. Set Service status to OFF for everyone\n7. Select Save",
      "expected": "Service status for Google Sites is set to: OFF",
      "color": "FFC003"
    },
    {
      "sectionNumber": "3.1.8",
      "Risk": "Low",
      "controlNumber": "3.1.8.1",
      "controlTitle": "Ensure access to external Google Groups is OFF for Everyone.",
      "controlDescription": "Control whether users in your organization can access external groups from their Google Workspace account. External groups are created outside your organization and might include a public community group or a group for a club a user belongs to.\n\nControl access to external groups by turning on or off the Google Groups additional service - a legacy service in your Admin console that does only one thing: It allows or blocks users from accessing external groups from their Google Workspace account. \n\n**NOTE:** This service has no effect on your organization's internal groups.",
      "rationaleStatement": "In general, most of the organization's personnel do not need to assess external groups. They can be allowed by exception as needed by the business.",
      "impactStatement": "Users can't access external groups from their Google Workspace account. However, they do continue to receive email digests from groups they're already subscribed to when you turn off the service.",
      "remediationProcedure": "To configure this setting via the Google Workspace Admin Console:\n\n1. Log in to https://admin.google.com as an administrator\n2. Select Apps\n3. Select Google Workspace\n4. Select Additional Google services\n5. Scroll down to Google Groups\n6. Set it to OFF for everyone\n7. Select Save",
      "expected": "Service status for Google Groups is set to: OFF",
      "color": "FFFF00"
    },
    {
      "sectionNumber": "3.1.9.1",
      "Risk": "Low",
      "controlNumber": "3.1.9.1.1",
      "controlTitle": "Ensure users access to Google Workspace Marketplace apps is restricted.",
      "controlDescription": "Restrict what Google Marketplace apps a user can install.",
      "rationaleStatement": "Users should only be allowed to install approved and vetted apps. This will limit the overall attack surface for the organization.",
      "impactStatement": "Users can only install approved Google Marketplace apps. This list will have to be created and maintained.",
      "remediationProcedure": "To configure this setting via the Google Workspace Admin Console: \n\n1. Log in to https://admin.google.com as an administrator\n2. Select Apps\n3. Select Google Workspace Marketplace apps\n4. Select Settings\n5. Under Manage Google Workspace Marketplace allowlist access, set Settings to install third-party Google Workspace Marketplace apps: to Allow users to install and run only selected apps from the Marketplace\n6. Select Save",
      "expected": "Allow users to install and run only selected apps from the Marketplace.",
      "color": "FFFF00"
    },
    {
      "sectionNumber": "4.1.1",
      "Risk": "High",
      "controlNumber": "4.1.1.1",
      "controlTitle": "Ensure 2-Step Verification (Multi-Factor Authentication) is enforced for all users in administrative roles.",
      "controlDescription": "Enforce 2-Step Verification (Multi-Factor Authentication) for all users assigned administrative roles. These include roles such as:\n\n- Help Desk Admin\n- Groups Admin\n- Super Admin\n- Services Admin\n- User Management Admin\n- Mobile Admin\n- Android Admin\n- Custom Admin Roles.",
      "rationaleStatement": "Add an extra layer of security to users accounts by asking users to verify their identity when they enter a username and password. 2-Step Verification (Multi-factor authentication) requires an individual to present a minimum of two separate forms of authentication before access is granted. 2-Step Verification provides additional assurance that the individual attempting to gain access is who they claim to be. With 2-Step Verification, an attacker would need to compromise at least two different authentication mechanisms, increasing the difficulty of compromise and thus reducing the risk.",
      "impactStatement": "Implementation of 2-Step Verification (multi-factor authentication) for all users in administrative roles will necessitate a change to user routine. All users in administrative roles will be required to enroll in 2-Step Verification using using phone, SMS, or an authentication application. After enrollment, use of 2-Step Verification will be required for future access to the environment.",
      "remediationProcedure": "To verify this setting via the Google Workspace Admin Console:\n\n1. Log in to https://admin.google.com as an administrator\n2. Go to Security and click on 2-Step Verification\n3. Select the appropriate group with ALL ADMIN ROLES -- Create this group if needed\n4. Under Authentication, set Allow users to turn on 2-Step Verification to checked\n5. Set Enforcement to On\n6. Set New user enrollment period is set to 2 weeks\n7. Under Frequency, set Allow user to trust device to unchecked\n8. Under Methods, set Any except verification codes via text, phone call to selected\n9. Select Save",
      "expected": "Allow users to turn on 2-Step Verification is enabled\nEnforcement is set to: On\nNew user enrollment period is set to: 2 weeks\nAllow user to trust device is disabled\nMethods is set to: Any except verification codes via text, phone call",
      "color": "CF2512"
    },
    {
      "sectionNumber": "4.1.1",
      "Risk": "High",
      "controlNumber": "4.1.1.3",
      "controlTitle": "Ensure 2-Step Verification (Multi-Factor Authentication) is enforced for all users.",
      "controlDescription": "Enforce 2-Step Verification (Multi-Factor Authentication) for all users.",
      "rationaleStatement": "Add an extra layer of security to users accounts by asking users to verify their identity when they enter a username and password. 2-Step Verification (Multi-factor authentication) requires an individual to present a minimum of two separate forms of authentication before access is granted. 2-Step Verification provides additional assurance that the individual attempting to gain access is who they claim to be. With 2-Step Verification, an attacker would need to compromise at least two different authentication mechanisms, increasing the difficulty of compromise and thus reducing the risk.",
      "impactStatement": "Implementation of 2-Step Verification (multi-factor authentication) for all users will necessitate a change to user routine. All users will be required to enroll in 2-Step Verification using using phone, SMS, or an authentication application. After enrollment, use of 2-Step Verification will be required for future access to the environment.",
      "remediationProcedure": "To configure this setting via the Google Workspace Admin Console: \n\n1. Log in to https://admin.google.com as an administrator\n2. Select Security\n3. Select 2-Step Verification\n4. Under Authentication, check - Allow users to turn on 2-Step Verification\n5. Set Enforcement to On\n6. Set New user enrollment period to 2 weeks\n7. Under Frequency, uncheck - Allow user to trust device\n8. Under Methods, select - Any except verification codes via text, phone call\n9. Select Save",
      "expected": "Allow users to turn on 2-Step Verification is enabled\nEnforcement is set to: On\nNew user enrollment period is set to: 2 weeks\nAllow user to trust device is disabled\nMethods is set to: Any except verification codes via text, phone call",
      "color": "CF2512"
    },
    {
      "sectionNumber": "4.1.2",
      "Risk": "High",
      "controlNumber": "4.1.2.1",
      "controlTitle": "Ensure Super Admin account recovery is enabled.",
      "controlDescription": "This option allows Super Admin users to recover access to their accounts if their password has been forgotten.\n\nThe option is not available if either _Single Sign On_ or _Password Sync_ is in use.",
      "rationaleStatement": "Allowing Super Admins to recover access to their accounts when they have forgotten their passwords reduces the number of support tickets generated by users, and reduces the amount of down time spent waiting on the account recovery process to initiate and complete.",
      "impactStatement": "The potential impact to Super Admins being allowed to recover their accounts includes:\n1. The Super Admins are now empowered to reset their passwords. \n2. The Super Admins will no longer need to call a helpdesk or open a support ticket to regain access to their account. \n\nAn organization that allows users to recover their account will realize less time spent by administrative staff working on these tasks.",
      "remediationProcedure": "To configure this setting via the Google Workspace Admin Console:\n\n1. Log in to https://admin.google.com as an administrator.\n2. Select Security.\n3. Under Account recovery select Super admin account recovery.\n4. Set Allow super admins to recover their account to checked \n5. Click Save",
      "expected": "Allow super admins to recover their account: ON",
      "color": "CF2512"
    },
    {
      "sectionNumber": "4.1.2",
      "Risk": "Low",
      "controlNumber": "4.1.2.2",
      "controlTitle": "Ensure User account recovery is enabled.",
      "controlDescription": "This option allows non-Super Admin users to recover access to their accounts if their password has been forgotten.\n\nThe option is not available if either _Single Sign On_ or _Password Sync_ is in use.",
      "rationaleStatement": "Allowing users to recover access to their accounts when they have forgotten their passwords reduces the number of support tickets generated by users, and reduces the amount of down time spent waiting on the account recovery process to initiate and complete.",
      "impactStatement": "The potential impact to users being allowed to recover their accounts includes:\n1. The user is now empowered to reset their passwords. \n2. The user will no longer need to call a helpdesk or open a support ticket to regain access to their account. \n\nAn organization that allows users to recover their account will realize less time spent by administrative staff working on these tasks.",
      "remediationProcedure": "To configure this setting via the Google Workspace Admin Console:\n\n1. Log in to https://admin.google.com as an administrator.\n2. Select Security.\n3. Select User account recovery\n4. Select either the pencil icon or the setting itself. \n5. Set Allow users and non-super admins to recover their account to checked.\n5. Select Save.",
      "expected": "Allow users and non-super admins to recover their account: ON",
      "color": "FFFF00"
    },
    {
      "sectionNumber": "4.1.5",
      "Risk": "High",
      "controlNumber": "4.1.5.1",
      "controlTitle": "Ensure password policy is configured for enhanced security.",
      "controlDescription": "Configure Google Workspace Password Policy with a more secure length and is enforced upon next sign-in to protect against the use of common password attacks.",
      "rationaleStatement": "Strong password policies protect an organization by prohibiting the use of weak passwords.",
      "impactStatement": "The potential impact associated with implementation of this setting is dependent upon the existing password policies in place in the environment. For environments that have strong password policies in place, the impact will be minimal. For organizations that do not have strong password policies in place, enhancing the password policy may require users to change passwords, and adhere to more stringent requirements than they have been accustomed to.\n\nConfiguring passwords to expire at a 1 year mark ensures that users are not forced to change passwords so often that easily discerned patterns are used in the creation of the passwords. The day-to-day impact on users will be that they have to manage fewer passwords changing on a frequent basis.\n\n**NOTE:** \nPassword should be changed immediately on any indication of system compromise, when a user role changes, and when a user leaves the organization.",
      "remediationProcedure": "To configure this setting via the Google Workspace Admin Console: \n\n1. Log in to https://admin.google.com as an administrator\n2. Select Security\n3. Select Password management\n4. Under Strength, set Enforce strong passwords to checked\n5. Under Length, set Minimum Length to 14 or greater\n6. Under Strength and Length enforcement, set Enforce password policy at next sign-in is checked\n7. Under Reuse, set Allow password reuse to unchecked\n8. Under Expiration, set Password reset frequency to 365 Days\n9. Select Save",
      "expected": "\nEnforce strong passwords is set to: True\nMinimum length is set to: 14+\nEnforce password policy at next sign-in is set to: True\nAllow password reuse is set to: False\nPassword reset frequency is set to: 365 Days\n",
      "color": "CF2512"
    },
    {
      "sectionNumber": "4.2.1",
      "Risk": "Low",
      "controlNumber": "4.2.1.3",
      "controlTitle": "Ensure internal apps can access Google Workspace APIs.",
      "controlDescription": "Enable access to Google Workspace APIs for customer-owned / developed applications.",
      "rationaleStatement": "All organization-built internal apps (owned by your organization), can be trusted to access restricted Google Workspace APIs. That way, the organization does not have to trust them all individually.",
      "impactStatement": null,
      "remediationProcedure": "To configure this setting via the Google Workspace Admin Console: \n\n1. Log in to https://admin.google.com as an administrator\n2. Select Security\n3. Select Access and Data Control\n4. Select API Controls, then select App access control\n5. Under Settings, select Trust internal, domain-owned apps\n6. Select Save",
      "expected": "Trust internal apps.",
      "color": "FFFF00"
    },
    {
      "sectionNumber": "4.2.2",
      "Risk": "Moderate",
      "controlNumber": "4.2.2.1",
      "controlTitle": "Ensure blocking access from unapproved geographic locations.",
      "controlDescription": "Restrict access to selected Google applications by geographic location.",
      "rationaleStatement": "Restricting access to known/approved geographic locations is a simple way to limit where attacks can originate from. Especially for smaller organizations that do not need global access to applications.",
      "impactStatement": "Valid/approved users traveling to a geographic region outside of those defined in the Access Level will not be able to access their applications.",
      "remediationProcedure": "To configure this setting via the Google Workspace Admin Console:\n\n**Create an appropriate Access Level**\n1. Log in to https://admin.google.com as an administrator\n2. Select Security\n3. Select Access and Data Control\n4. Select Context-Aware Access\n5. Select Access levels\n6. Select Create Access Level\n7. Under Details - Name the Access Level (Suggested using a clear name - ex. \"Restrict to USA\")\n8. Under Conditions - Select Basic\n9. Under Condition 1 - Select Meet attributes\n10. Under Condition 1 - Select Add Attribute\n11. Click on the Add Attribute drop-down box and select Geographic origin\n12. Click on the far right drop-down box and select the region, or regions, to be allowed (ex. United States) \n13. Click Save\n\n**Assign the defined Access Level has been assigned to the application(s) that need the restriction**\n1. Log in to https://admin.google.com as an administrator\n2. Select Security\n3. Select Access and Data Control\n4. Select Context-Aware Access\n5. Select Assign access levels\n6. For each application listed that needs this restriction, select Assign\n7. Under, Access is granted when a user meets conditions in at least one of the selected access levels, ensure the previously named Access Level (ex. \"Restrict to USA\") is checked\n8. Also, ensure Apply to Google desktop and mobile apps is checked\n\n**NOTE:** CIS recommends geographically restricting assess to the following Google applications at minimum:\n1. Admin Console\n2. Drives and Docs\n3. Gmail\n4. Google Vault",
      "expected": "Geographic restrictions are enabled for the Admin Console, Drives and Docs, Gmail, and Google Vault",
      "color": "FFC003"
    },
    {
      "sectionNumber": "4.2.3",
      "Risk": "Moderate",
      "controlNumber": "4.2.3.1",
      "controlTitle": "Ensure DLP policies for Google Drive are configured.",
      "controlDescription": "Enabling Data Loss Prevention (DLP) policies for Google Drive allows organizations to control the content that users can share in Google Drive files outside the organization.",
      "rationaleStatement": "Enabling DLP policies alerts users and administrators that specific types of data should not be exposed, helping to protect the data from accidental exposure. DLP gives you control over what users can share, and prevents unintended exposure of sensitive information such as credit card numbers or identity numbers",
      "impactStatement": "Configuring a DLP policy for Google Drive will detect or block sensitive information.",
      "remediationProcedure": "To configure this setting via the Google Workspace Admin Console:\n\n1. Log in to https://admin.google.com as an administrator\n2. Select Security\n3. Select Access and Data Control\n4. Select Data protection\n5. Select Manage Rules\n6. Select ADD RULE, then select either New rule or New rule from template\n\n**New rule**\n\nExamples can be found **[here](https://support.google.com/a/answer/9655387?hl=en&ref_topic=9646660#zippy=%2Cplan-and-then-create-rules%2Cexample-protect-social-security-numbers-using-a-predefined-classifier)**.\n\n1. Set the rule Name\n2. Optionally - Set the rule controlDescription\n3. Set the Scope as appropriate\n4. Select Continue\n5. Set Triggers by checking - File modified under Google Drive\n6. Select ADD CONDITION and configure values (Field, Comparison Operator, Content to match) - _Repeat as appropriate_\n7. Select Continue\n8. Under Actions, select the desired action to take for each incident\n9. Under Alerting, select the desired severity level\n10. Under Alerting, Select - Send to alert center\n11. Select Continue\n12. Select Create\n\n**New rule from template**\n1. Select the desired rule template\n2. Optionally set the Name as desired\n3. Optionally set the controlDescription as desired\n4. Set the Scope as appropriate\n5. Select Continue\n6. Modify preconfigured Conditions as desired, or add additional conditions\n7. Select Continue\n8. Under Alerting, Select - Send to alert center\n9. Select Continue\n10. Select Create",
      "expected": "Data protection rules exist and are enabled",
      "color": "FFC003"
    },
    {
      "sectionNumber": "4.2.4",
      "Risk": "Moderate",
      "controlNumber": "4.2.4.1",
      "controlTitle": "Ensure Google session control is configured.",
      "controlDescription": "Configure Google Workspace's session control to strengthen session expiration.",
      "rationaleStatement": "As an administrator, you can control how long users can access Google services, such as Gmail on the web, without having to sign in again. For example, for users that work remotely or from untrusted locations, you might want to limit the time that they can access sensitive resources by applying a shorter web session length. If users want to continue accessing a resource when a session ends, they're prompted to sign in again and start a new session.\n\nHow the settings work on mobile devices varies by device and app.",
      "impactStatement": "The potential impact associated with implementation of this setting are:\n- When a web session expires for a user, they see the Verify it's you page and must sign in again.\n- When you change the session length, users need to sign out and in again for settings to take effect. \n- If you set the session to never expire, users never have to sign in again.\n- If you need some users to sign in more frequently than others, place them in different organizational units. Then, apply different session lengths to them. That way, certain users won't be interrupted to sign in when it isn't necessary. \n- If a Google Meet meeting starts within 2 hours of a session's scheduled expiration, the user is forced to sign in again before the start of the meeting. This helps avoid an interruption to the meeting while in-progress.\n- If you're using a third-party identity provider (IdP), such as Okta or Ping, and you set web session lengths for your users, you need to set the IdP session length parameter to expire before the Google session expires. That way, your users will be forced to sign in again. If the third-party IdP session is still valid when the Google session expires, the Google session might be renewed automatically without the user signing in again.",
      "remediationProcedure": "To verify this setting via the Google Workspace Admin Console:\n\n1. Log in to https://admin.google.com as an administrator\n2. Select Security\n3. Select Access and Data Control\n4. Select Google session control\n5. Set Web session duration to 12 hours or less\n6. Select Save",
      "expected": "Web session duration is set to: 12 hours or less.",
      "color": "FFC003"
    },
    {
      "sectionNumber": "4.2.6",
      "Risk": "High",
      "controlNumber": "4.2.6.1",
      "controlTitle": "Ensure less secure app access is disabled.",
      "controlDescription": "Configure Google Workspace security settings to prevent access to less secure apps.",
      "rationaleStatement": "You can block sign-in attempts from some apps or devices that are less secure. Apps that are less secure don't use modern security standards, such as OAuth. Using apps and devices that don't use modern security standards increases the risk of accounts being compromised. Blocking these apps and devices helps keep your users and data safe.",
      "impactStatement": "The potential impact associated with implementation of this setting is that users won't be able to turn on access to less secure apps. When you disable access to less secure apps while a less secure app has an open connection with a user account, the app will time out when it tries to refresh the connection. Timeout periods vary per app.",
      "remediationProcedure": "To configure this setting via the Google Workspace Admin Console:\n\n1. Log in to https://admin.google.com as an administrator\n2. Select Security\n3. Select Access and Data Control\n4. Select Less secure apps\n5. Select Disable access to less secure apps (Recommended)\n6. Click Save to commit this configuration change.",
      "expected": "Disable access to less secure apps is selected.",
      "color": "CF2512"
    },
    {
      "sectionNumber": "4.3",
      "Risk": "Moderate",
      "controlNumber": "4.3.1",
      "controlTitle": "Ensure the Dashboard is reviewed regularly for anomalies.",
      "controlDescription": "As an administrator, you can use the security dashboard to see an overview of different security reports. By default, each security report panel displays data from the last 7 days. You can customize the dashboard to view data from Today, Yesterday, This week, Last week, This month, Last month, or Days ago (up to 180 days).\n\nCharts/reports available (Minimum, but could be many more depending on account type):\n\n- DLP incidents\n- Top policy incidents\n- Failed device password attempts\n- Compromised device events\n- Suspicious device activities\n- OAuth scope grants by product (beta customers only)\n- OAuth grant activity\n- OAuth grants to new apps\n- User login attempts - Challenge method\n- User login attempts - Failed\n- User login attempts - Suspicious\n\nDetails on what each of these charts/reports mean can be found **[here](https://apps.google.com/supportwidget/articlehome?article_url=https%3A%2F%2Fsupport.google.com%2Fa%2Fanswer%2F7492330&assistant_id=generic-unu&product_context=7492330&product_name=UnuFlow&trigger_context=a)**. This report should be reviewed weekly.\n\n**NOTE:** The availability of each individual report on the security dashboard depends on your Google Workspace edition. See Google documentation for more details.\n\n**NOTE:** In larger organizations reviewing this entire report weekly may not be possible. At a minimum, all Administrator and Super Administrator users should be reviewed, since they are a higher risk. These can be filtered from the overall user list.",
      "rationaleStatement": "The Security report provides a comprehensive view of how people share and access data and whether they take appropriate security precautions. For example, you can review who installs external apps, shares numerous files, skips 2-Step Verification, and uses security keys.",
      "impactStatement": "No user impact.",
      "remediationProcedure": "The remediation for any anomalies in the various fields varies widely (different sections of the Google Workspace Admin UI). Please refer to Google's documentation for specifics (**[here](https://apps.google.com/supportwidget/articlehome?article_url=https%3A%2F%2Fsupport.google.com%2Fa%2Fanswer%2F7492330&assistant_id=generic-unu&product_context=7492330&product_name=UnuFlow&trigger_context=a)**).\n\n**NOTE:** Many of these settings will be remedied by implementing other sections of this Benchmark. For example, an Admin not enrolled in 2-Step Verification can be remedied by implementing the remediationProcedure for the recommendation **_Ensure 2-Step Verification (Multi-Factor Authentication) is enforced for all users in administrative roles_**.",
      "expected": "User Reports Dashboard is reviewed regularly for anomalies.",
      "color": "FFC003"
    },
    {
      "sectionNumber": "4.3",
      "Risk": "Moderate",
      "controlNumber": "4.3.2",
      "controlTitle": "Ensure the Security health is reviewed regularly for anomalies.",
      "controlDescription": "As an administrator, the security health page enables you to monitor the configuration of your Admin console settings from one location. For example, you can check the status of settings like automatic email forwarding, device encryption, Drive sharing settings, and much more. \n\nSettings reported (Minimum, but could be many more depending on account type):\n\n- Blocking of compromised mobile devices\n- Mobile management\n- Mobile password requirements\n- Device encryption\n- Mobile inactivity reports\n- Auto account wipe\n- Application verification\n- Installation of mobile applications from unknown sources\n- External media storage\n- Two-step verification for users\n- Two-step verification for admins\n- Security key enforcement for admins\n\nDetails on what each of these report entries mean can be found **[here](https://apps.google.com/supportwidget/articlehome?article_url=https%3A%2F%2Fsupport.google.com%2Fa%2Fanswer%2F7491656&assistant_id=generic-unu&product_context=7491656&product_name=UnuFlow&trigger_context=a)**. This report should be reviewed weekly.\n\n**NOTE:** The availability of each individual report on the security dashboard depends on your Google Workspace edition. See Google documentation for more details.",
      "rationaleStatement": "The security health page provides visibility into your Admin console settings to help you better understand and manage security risks. If needed, you can make adjustments to your domain's settings based on general security guidelines and best practices, while balancing these guidelines with your organization's business needs and risk management policy.",
      "impactStatement": "No user impact.",
      "remediationProcedure": "The remediation for any anomalies in the various settings varies widely (different sections of the Google Workspace Admin UI). Please refer to Google's documentation for specifics (**[here](https://apps.google.com/supportwidget/articlehome?article_url=https%3A%2F%2Fsupport.google.com%2Fa%2Fanswer%2F7491656&assistant_id=generic-unu&product_context=7491656&product_name=UnuFlow&trigger_context=a)**).\n\n**NOTE:** Many of these settings will be remedied by implementing other sections of this Benchmark. For example, an Admin not enrolled in 2-Step Verification can be remedied by implementing the remediationProcedure for the recommendation **_Ensure 2-Step Verification (Multi-Factor Authentication) is enforced for all users in administrative roles_**.",
      "expected": "Security health is reviewed regularly for anomalies.",
      "color": "FFC003"
    },
    {
      "sectionNumber": "5.1.1",
      "Risk": "Low",
      "controlNumber": "5.1.1.1",
      "controlTitle": "Ensure the App Usage Report is reviewed regularly for anomalies.",
      "controlDescription": "As an administrator, you can use Apps usage reports to get an in-depth understanding of how your users use Google Workspace apps. \n\nFields Available:\n\n- User\n- Gmail storage used (MB)\n- Drive storage used (MB)\n- Photos storage used (MB)\n- Total storage used (MB)\n- Storage used (%)\n- Classroom - last used time\n- Classes created\n- Posts created\n- Total emails\n- Emails sent\n- Emails received\n- Gmail (IMAP) - last used time\n- Gmail (POP) - last used time\n- Gmail (Web) - last used time\n- Files edited\n- Files viewed\n- Drive - last active time\n- Files added\n- Other types added\n- Google Docs added\n- Google Sheets added\n- Google Slides added\n- Google Forms added\n- Google Drawings added\n- Posts\n- +1s\n- +1s received\n- Comments\n- Comments received\n- Reshares\n- Reshares received\n- Search queries\n- Search queries from web\n- Search queries from Android\n- Search queries from iOS\n\nDetails on what each of these fields mean can be found **[here](https://apps.google.com/supportwidget/articlehome?hl=en&article_url=https%3A%2F%2Fsupport.google.com%2Fa%2Fanswer%2F4579578%3Fhl%3Den&assistant_id=generic-unu&product_context=4579578&product_name=UnuFlow&trigger_context=a)**. This report should be reviewed weekly.\n\n**NOTE:** In larger organizations reviewing this entire report weekly may not be possible. At a minimum, all Administrator and Super Administrator users should be reviewed, since they are a higher risk. These can be filtered from the overall user list.",
      "rationaleStatement": "The App usage report can allow administrator to discover user that are potentially using application that they do not have access to and/or using in atypical ways.",
      "impactStatement": "No user impact.",
      "remediationProcedure": "The remediation for any anomalies in the various fields varies widely (different sections of the Google Workspace Admin UI). Please refer to Google's documentation for specifics (**[here](https://apps.google.com/supportwidget/articlehome?hl=en&article_url=https%3A%2F%2Fsupport.google.com%2Fa%2Fanswer%2F4579578%3Fhl%3Den&assistant_id=generic-unu&product_context=4579578&product_name=UnuFlow&trigger_context=a)**).\n\n**NOTE:** Many of these settings will be remedied by implementing other sections of this Benchmark. For example, an Admin showing recent Gmail (IMAP) - last used time and/or Gmail (POP) - last used time can be remedied by implementing the remediationProcedure for the recommendation **_Ensure POP and IMAP access is disabled for all users_**.",
      "expected": "App Usage Report is reviewed regularly for anomalies.",
      "color": "FFFF00"
    },
    {
      "sectionNumber": "5.1.1",
      "Risk": "Moderate",
      "controlNumber": "5.1.1.2",
      "controlTitle": "Ensure the Security Report is reviewed regularly for anomalies.",
      "controlDescription": "As your organization's administrator, you can monitor your users' exposure to data compromise by reviewing the security report. \n\nFields Available:\n- User\n- External apps\n- 2-Step verification enrollment\n- 2-Step verification enforcement\n- Password length compliance\n- Password strength\n- User account status\n- Admin status\n- Security keys enrolled\n- Less secure apps access\n- Gmail (IMAP) - last used time\n- Gmail (POP) - last used time\n- Gmail (Web) - last used time\n- External shares\n- Internal shares\n- Public\n- Anyone with link\n- Outside domain\n- Anyone in domain shares\n- Anyone in domain with link shares\n- Within domain shares\n- Private shares\n\nDetails on what each of these fields mean can be found **[here](https://apps.google.com/supportwidget/articlehome?hl=en&article_url=https%3A%2F%2Fsupport.google.com%2Fa%2Fanswer%2F6000269%3Fhl%3Den&assistant_id=generic-unu&product_context=6000269&product_name=UnuFlow&trigger_context=a)**. This report should be reviewed weekly.\n\n**NOTE:** In larger organizations reviewing this entire report weekly may not be possible. At a minimum, all Administrator and Super Administrator users should be reviewed, since they are a higher risk. These can be filtered from the overall user list.",
      "rationaleStatement": "The Security report provides a comprehensive view of how people share and access data and whether they take appropriate security precautions. For example, you can review who installs external apps, shares numerous files, skips 2-Step Verification, and uses security keys.",
      "impactStatement": "No user impact.",
      "remediationProcedure": "The remediation for any anomalies in the various fields varies widely (different sections of the Google Workspace Admin UI). Please refer to Google's documentation for specifics (**[here](https://apps.google.com/supportwidget/articlehome?hl=en&article_url=https%3A%2F%2Fsupport.google.com%2Fa%2Fanswer%2F6000269%3Fhl%3Den&assistant_id=generic-unu&product_context=6000269&product_name=UnuFlow&trigger_context=a)**).\n\n**NOTE:** Many of these settings will be remedied by implementing other sections of this Benchmark. For example, an Admin not enrolled in 2-Step Verification can be remedied by implementing the remediationProcedure for the recommendation **_Ensure 2-Step Verification (Multi-Factor Authentication) is enforced for all users in administrative roles_**.",
      "expected": "User Security Reports are reviewed regularly for anomalies",
      "color": "FFC003"
    },
    {
      "sectionNumber": "6",
      "Risk": "Moderate",
      "controlNumber": "6.1",
      "controlTitle": "Ensure User's password changed is configured.",
      "controlDescription": "Configuring and enabling the setting that an alert will be generated when a user's password has changed.",
      "rationaleStatement": "Ensuring that administrators are alerted when user passwords are changed provides organizations with the ability to detect and halt potential attacks involving credential compromise and account takeover.",
      "impactStatement": "This setting should have no impact on the end user but will send emails to super administrators when triggered.",
      "remediationProcedure": "To verify this setting via the Google Workspace Admin Console:\n\n1. Log in to https://admin.google.com as an administrator.\n2. Select Rules\n3. Under Google protects you by default select View list.\n4. Scroll to User's password changed and select it. \n5. Within the Actions pane, click the edit pencil on the right side of the pane. \n6. Select Send to alert center (This will result in the alert being set to On).\n7. Set the alert severity to Moderate\n8. To enable emails when this alert condition is met, select Send email notifications. Once enabled, the All super administrators option is selected by default. \n9. Click Review to confirm the values. \n10. Click Update Rule. \n11. Confirm that the User's password changed shows an Alert status of On in the list.",
      "expected": "Alerts: On\nSeverity: Medium\nEmail notifications: On\nNotification recipients: All super administrators",
      "color": "FFC003"
    },
    {
      "sectionNumber": "6",
      "Risk": "Moderate",
      "controlNumber": "6.2",
      "controlTitle": "Ensure Government-backed attacks is configured.",
      "controlDescription": "Configuring and enabling the setting that an alert will be generated when Google believes your users are being targeted by a government-backed attack.",
      "rationaleStatement": "Ensuring that administrators are alerted that they may be being targeted by a government-backed entity allows them time to check their defenses and potentially up their sensitivity for anomalies. \n\n**NOTE:** Google sends these out of an abundance of caution - the notice does not necessarily mean that the account has been compromised or that there is a widespread attack. Rather, the notice reflects Goggle's assessment that a government-backed attacker has likely attempted to access the user's account or computer through phishing or malware, for example.",
      "impactStatement": "This setting should have no impact on the end user but will send emails to super administrators when triggered.",
      "remediationProcedure": "To verify this setting via the Google Workspace Admin Console:\n\n1. Log in to https://admin.google.com as an administrator.\n2. Select Rules\n3. Under Google protects you by default select View list.\n4. Scroll to Government-backed attacks and select it. \n5. Within the Actions pane, click the edit pencil on the right side of the pane. \n6. Select Send to alert center (This will result in the alert being set to On).\n7. Set the alert severity to High\n8. To enable emails when this alert condition is met, select Send email notifications. Once enabled, the All super administrators option is selected by default. \n9. Click Review to confirm the values. \n10. Click Update Rule. \n11. Confirm that the Government-backed attacks shows an Alert status of On in the list.",
      "expected": "Alerts: On\nSeverity: High\nEmail notifications: On\nNotification recipients: All super administrators",
      "color": "FFC003"
    },
    {
      "sectionNumber": "6",
      "Risk": "Moderate",
      "controlNumber": "6.3",
      "controlTitle": "Ensure User suspended due to suspicious activity is configured.",
      "controlDescription": "Configuring and enabling the setting that an alert will be generated when Google suspended a user's account due to a potential compromise detected.",
      "rationaleStatement": "Ensuring that administrators are alerted when the account was suspended by Google. The reason for this should be investigated ASAP, since it could be a possible indication of malicious activity. In any case, the user's account was suspended and something will need to be done to allow the user to resume work.",
      "impactStatement": "Emails will be sent to all super administrators when triggered. Also, the user's account will be suspended and something will need to be done about that based on company policy (investigated, re-enabled, etc.).",
      "remediationProcedure": "To verify this setting via the Google Workspace Admin Console:\n\n1. Log in to https://admin.google.com as an administrator.\n2. Select Rules\n3. Under Google protects you by default select View list.\n4. Scroll to User suspended due to suspicious activity and select it. \n5. Within the Actions pane, click the edit pencil on the right side of the pane. \n6. Select Send to alert center (This will result in the alert being set to On).\n7. Set the alert severity to High\n8. To enable emails when this alert condition is met, select Send email notifications. Once enabled, the All super administrators option is selected by default. \n9. Click Review to confirm the values. \n10. Click Update Rule. \n11. Confirm that the User suspended due to suspicious activity shows an Alert status of On in the list.",
      "expected": "Alerts: On\nSeverity: High\nEmail notifications: On\nNotification recipients: All super administrators",
      "color": "FFC003"
    },
    {
      "sectionNumber": "6",
      "Risk": "High",
      "controlNumber": "6.4",
      "controlTitle": "Ensure User granted Admin privilege is configured.",
      "controlDescription": "Configuring and enabling the setting that an alert will be generated when a user has been granted an admin privilege.",
      "rationaleStatement": "Ensuring that administrators are alerted when a user is given increased privileges could be an indication of compromise unless this access has been approved.",
      "impactStatement": "This setting should have no impact on the end user but will send emails to super administrators when triggered.",
      "remediationProcedure": "To verify this setting via the Google Workspace Admin Console:\n\n1. Log in to https://admin.google.com as an administrator.\n2. Select Rules\n3. Under Google protects you by default select View list.\n4. Scroll to User granted Admin privilege and select it. \n5. Within the Actions pane, click the edit pencil on the right side of the pane. \n6. Select Send to alert center (This will result in the alert being set to On).\n7. Set the alert severity to Moderate\n8. To enable emails when this alert condition is met, select Send email notifications. Once enabled, the All super administrators option is selected by default. \n9. Click Review to confirm the values. \n10. Click Update Rule. \n11. Confirm that the User granted Admin privilege shows an Alert status of On in the list.",
      "expected": "Alerts: On\nSeverity: Medium\nEmail notifications: On\nNotification recipients: All super administrators",
      "color": "CF2512"
    },
    {
      "sectionNumber": "6",
      "Risk": "Moderate",
      "controlNumber": "6.5",
      "controlTitle": "Ensure Suspicious programmatic login is configured.",
      "controlDescription": "Configuring and enabling the setting that an alert will be generated when Google detects suspicious login attempts from applications or computer programs.",
      "rationaleStatement": "Ensuring that administrators are alerted when suspicious login attempts occur. This could be an indication of an active attack on the company by an adversary using previously obtained credentials.",
      "impactStatement": "This setting should have no impact on the end user but will send emails to super administrators when triggered.",
      "remediationProcedure": "To verify this setting via the Google Workspace Admin Console:\n\n1. Log in to https://admin.google.com as an administrator.\n2. Select Rules\n3. Under Google protects you by default select View list.\n4. Scroll to Suspicious programmatic login and select it. \n5. Within the Actions pane, click the edit pencil on the right side of the pane. \n6. Select Send to alert center (This will result in the alert being set to On).\n7. Set the alert severity to Low\n8. To enable emails when this alert condition is met, select Send email notifications. Once enabled, the All super administrators option is selected by default. \n9. Click Review to confirm the values. \n10. Click Update Rule. \n11. Confirm that the Suspicious programmatic login shows an Alert status of On in the list.",
      "expected": "Alerts: On\nSeverity: Low\nEmail notifications: On\nNotification recipients: All super administrators",
      "color": "FFC003"
    },
    {
      "sectionNumber": "6",
      "Risk": "Moderate",
      "controlNumber": "6.6",
      "controlTitle": "Ensure Suspicious login is configured.",
      "controlDescription": "Configuring and enabling the setting that an alert will be generated when Google detects a sign-in attempt that doesn't match a user's normal behavior, such as a sign-in from an unusual location.",
      "rationaleStatement": "Ensuring that administrators are alerted when suspicious login attempts occur. This could be an indication of an active attack on the company by an adversary using previously obtained credentials.",
      "impactStatement": "This setting should have no impact on the end user but will send emails to super administrators when triggered.",
      "remediationProcedure": "To verify this setting via the Google Workspace Admin Console:\n\n1. Log in to https://admin.google.com as an administrator.\n2. Select Rules\n3. Under Google protects you by default select View list.\n4. Scroll to Suspicious login and select it. \n5. Within the Actions pane, click the edit pencil on the right side of the pane. \n6. Select Send to alert center (This will result in the alert being set to On).\n7. Set the alert severity to Low\n8. To enable emails when this alert condition is met, select Send email notifications. Once enabled, the All super administrators option is selected by default. \n9. Click Review to confirm the values. \n10. Click Update Rule. \n11. Confirm that the Suspicious login shows an Alert status of On in the list.",
      "expected": "Alerts: On\nSeverity: Low\nEmail notifications: On\nNotification recipients: All super administrators",
      "color": "FFC003"
    },
    {
      "sectionNumber": "6",
      "Risk": "Moderate",
      "controlNumber": "6.7",
      "controlTitle": "Ensure Leaked password is configured.",
      "controlDescription": "Configuring and enabling the setting that an alert will be generated when Google detects compromised credentials requiring a reset of a user's password.",
      "rationaleStatement": "Ensuring that administrators are alerted when Google detects that a user's credentials have been compromised due to a publicized breach. This is usually because the user has reused their credentials at another site that was breached.",
      "impactStatement": "Emails will be sent to super administrators when triggered and in these cases, the user's password will need to be changed.",
      "remediationProcedure": "To verify this setting via the Google Workspace Admin Console:\n\n1. Log in to https://admin.google.com as an administrator.\n2. Select Rules\n3. Under Google protects you by default select View list.\n4. Scroll to Leaked password and select it. \n5. Within the Actions pane, click the edit pencil on the right side of the pane. \n6. Select Send to alert center (This will result in the alert being set to On).\n7. Set the alert severity to High\n8. To enable emails when this alert condition is met, select Send email notifications. Once enabled, the All super administrators option is selected by default. \n9. Click Review to confirm the values. \n10. Click Update Rule. \n11. Confirm that the Leaked password shows an Alert status of On in the list.",
      "expected": "Alerts: On\nSeverity: Medium\nEmail notifications: On\nNotification recipients: All super administrators",
      "color": "FFC003"
    },
    {
      "sectionNumber": "6",
      "Risk": "Low",
      "controlNumber": "6.8",
      "controlTitle": "Ensure Gmail potential employee spoofing is configured.",
      "controlDescription": "Configuring and enabling the setting that an alert will be generated when Google detects incoming messages are received where a sender's name is in your Google Workspace directory, but the mail is not from your company's domains or domain aliases.",
      "rationaleStatement": "Ensuring that administrators are alerted when the email is being spoofed since this could be an indication of a phishing attempt.",
      "impactStatement": "This setting should have no impact on the end user but will send emails to super administrators when triggered.",
      "remediationProcedure": "To verify this setting via the Google Workspace Admin Console:\n\n1. Log in to https://admin.google.com as an administrator.\n2. Select Rules\n3. Under Google protects you by default select View list.\n4. Scroll to Gmail potential employee spoofing and select it. \n5. Within the Actions pane, click the edit pencil on the right side of the pane. \n6. Select Send to alert center (This will result in the alert being set to On).\n7. Set the alert severity to Moderate\n8. To enable emails when this alert condition is met, select Send email notifications. Once enabled, the All super administrators option is selected by default. \n9. Click Review to confirm the values. \n10. Click Update Rule. \n11. Confirm that the Gmail potential employee spoofing shows an Alert status of On in the list.",
      "expected": "Alerts: On\nSeverity: Medium\nEmail notifications: On\nNotification recipients: All super administrators",
      "color": "FFFF00"
    }
  ]
  